pisoBodyFoam_FF1/SingleRegion/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions


cp -r 0.org 0 > /dev/null 2>&1

./generateMesh

runApplication decomposePar
runParallel pisoBodyFoam

# ----------------------------------------------------------------- end-of-file
